---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsUndersideSurfaceStyle.Smooth
enum: Autodesk.Revit.DB.Architecture.StairsUndersideSurfaceStyle
source: html/02299593-1c88-63a3-65f2-99cf5254386f.htm
---
# Autodesk.Revit.DB.Architecture.StairsUndersideSurfaceStyle.Smooth

The underside surface of the run is smooth.